helix-kit/helix-kit/embedded/esp32/core/sdkconfig.defaults
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_IDF_TARGET="esp32"
CONFIG_IDF_TARGET_ESP32=y
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
# CONFIG_BT_BLUEDROID_ENABLED is not set
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_GATT_MAX_PROCS=4
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
# CONFIG_COMPILER_OPTIMIZATION_DEBUG is not set
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_TLS_CLIENT_ONLY=y
# CONFIG_MBEDTLS_TLS_SERVER_AND_CLIENT is not set
# CONFIG_MBEDTLS_TLS_SERVER is not set
CONFIG_MQTT_PROTOCOL_311=y
# CONFIG_MQTT_TRANSPORT_WEBSOCKET is not set
# CONFIG_MQTT_TRANSPORT_WEBSOCKET_SECURE is not set
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_4mb.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions_4mb.csv"
CONFIG_EXAMPLE_CONNECT_WIFI=y
# CONFIG_EXAMPLE_CONNECT_ETHERNET is not set
CONFIG_EXAMPLE_CONNECT_IPV4=y
# CONFIG_EXAMPLE_CONNECT_IPV6 is not set
# CONFIG_LWIP_IPV6 is not set
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_LED_BLINKER_GPIO=2
CONFIG_LED_BLINKER_TWO_GPIO=16
CONFIG_LED_BLINKER_TWO_SECONDARY_GPIO=17

# Dynamic TLS buffers: allocate mbedTLS RX/TX record buffers on demand and free
# them when idle, and free peer cert / config after the handshake. Required to
# run two concurrent TLS sessions (MQTT control plane + HelixStream data plane)
# alongside Wi-Fi + BLE on the ESP32's limited RAM (fixes SSL_ALLOC_FAILED).
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_PEER_CERT=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y

# The console_bridge is provisioned over serial and runs headless in the field:
# it needs no BLE (GATT provisioning) and no on-device WebSocket server. Compile
# both out to free the ~50 KB+ of RAM (NimBLE controller/host) needed to run the
# HelixStream data-plane TLS session concurrently with the MQTT control plane.
CONFIG_BT_ENABLED=n
CONFIG_HELIX_TRANSPORT_WEBSOCKET=n

# Pin the MQTT cloud transport ON. It defaults to y in Kconfig, but it is the
# console_bridge's control plane (the gateway delivers open/close/list over
# MQTT), so make it explicit here — a stale shared .build/dynamic/sdkconfig once
# carried it off, which compiles the whole cloud path out and leaves the device
# silently unreachable after Wi-Fi + time sync.
CONFIG_HELIX_TRANSPORT_MQTT=y
